Repository: 132u/smart
Catalog: TestingFiles/Editor/pretranslateFile.xliff
Languages: ru

source: Hello world1.
ru: state='new' approved = 'no'

source: Hello world11.
ru: state='new' approved = 'yes'

source: Hello world2.
ru: state='needs-translation' approved = 'no'

source: Hello world12.
ru: state='needs-translation' approved = 'yes'

source: Hello world3.
ru: state='needs-adaptation' approved = 'no'

source: Hello world13.
ru: state='needs-adaptation' approved = 'yes'

source: Hello world4.
ru: state='needs-l10n' approved = 'no'

source: Hello world14.
ru: state='needs-l10n' approved = 'yes'

source: Hello world5.
ru: state='needs-review-adaptation' approved = 'no'

source: Hello world15.
ru: state='needs-review-adaptation' approved = 'yes'

source: Hello world6.
ru: state='needs-review-l10n' approved = 'no'

source: Hello world16.
ru: state='needs-review-l10n' approved = 'yes'

source: Hello world7.
ru: state='needs-review-translation' approved = 'no'

source: Hello world17.
ru: state='needs-review-translation' approved = 'yes'

source: Hello world8.
ru: state='translated' approved = 'no'

source: Hello world18.
ru: state='translated' approved = 'yes'

source: Hello world9.
ru: state='signed-off' approved = 'no'

source: Hello world19.
ru: state='signed-off' approved = 'yes'

source: Hello world10.
ru: state='final' approved = 'no'

source: Hello world20.
ru: state='final' aprooved = 'yes'
